app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies"  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies"  ORDER BY "movies"."release_date" ASC
---
  def index
    @movies = Movie.all
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      @movies = Movie.order(:title)
      @title_header = 'hilite'
    when 'release_date'
      @movies = Movie.order(:release_date)